library(data.table)
library(tidyverse)

target = c('등촌3동', '방화3동', '번2동', '번3동', '삼성동', '가양2동', '가양3동', '남영동', 
           '도봉1동', '둔촌1동', '장위2동', '종로1.2.3.4가동', '중계2.3동', '중계4동', '회현동', 
           '청량리동', '삼청동', '상계3.4동', '수서동', '월계2동', '을지로동')

dong_prop = 
  tribble(
    ~dong, ~prop,
    '등촌3동', 0.087,
    '방화3동', 0.104,
    '번2동', 0.159,
    '번3동', 0.039,
    '삼성동', 0.064,
    '가양2동', 0.138,
    '가양3동', 0.106,
    '남영동', 0.209,
    '도봉1동', 0.058,
    '둔촌1동', 0.000,
    '장위2동', 0.062,
    '종로1.2.3.4가동', 0.141,
    '중계2.3동', 0.158,
    '중계4동', 0.083,
    '회현동', 0.140,
    '청량리동', 0.069,
    '삼청동', 0.187,
    '상계3.4동', 0.039,
    '수서동', 0.076,
    '월계2동', 0.153,
    '을지로동', 0.075
  )

dong_prop %>% arrange(prop) %>% head(14)

### 5개 행정동 : 번3동, 상계3.4동, 도봉1동, 장위2동, 삼성동 선정






















